; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v4 - type_1 ?v5 - type_3)
 	      (pred_4 ?v6 - object ?v5 - type_3)
	      (pred_2 ?v4 - type_1 ?v8 - type_2)
	      (pred_3 ?v4 - type_1 ?v6 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v4 - type_1 ?v3 ?v1 - type_3)
       :precondition (and  (pred_1 ?v4 ?v3))
       :effect (and  (pred_1 ?v4 ?v1)
		     (not (pred_1 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_1 ?v2 - object ?v7 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_1 ?v4 ?v7) (pred_2 ?v4 ?v8))
       :effect (and (pred_3 ?v4 ?v2 ?v8)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_2 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_1 ?v2 - object ?v7 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v2 ?v8) (pred_1 ?v4 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_2 ?v4 ?v8)
		    (not (pred_3 ?v4 ?v2 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_03 - type_1
obj_08 obj_11 obj_09 obj_10 - type_2
obj_06 obj_13 obj_14 obj_02 - type_3
obj_07 obj_05 obj_04 obj_12 - object)
(:init
(pred_1 obj_01 obj_14)
(pred_2 obj_01 obj_08)
(pred_2 obj_01 obj_11)
(pred_1 obj_03 obj_14)
(pred_2 obj_03 obj_09)
(pred_2 obj_03 obj_10)
(pred_4 obj_07 obj_06)
(pred_4 obj_05 obj_13)
(pred_4 obj_04 obj_14)
(pred_4 obj_12 obj_13)
)
(:goal
(and
(pred_4 obj_07 obj_06)
(pred_4 obj_05 obj_13)
(pred_4 obj_04 obj_02)
(pred_4 obj_12 obj_14)
)
)

(:constraints
  (always (not (pred_1 obj_01 obj_02)))
)
)

; plan
1. (op_1 obj_03 obj_04 obj_14 obj_10)
   deleted: (pred_4 obj_04 obj_14) (pred_2 obj_03 obj_10)
   added: (pred_3 obj_03 obj_04 obj_10)
   goals met: 2 of 4
2. (op_2 obj_01 obj_14 obj_13)
   deleted: (pred_1 obj_01 obj_14)
   added: (pred_1 obj_01 obj_13)
   goals met: 2 of 4
3. (op_2 obj_03 obj_14 obj_02)
   deleted: (pred_1 obj_03 obj_14)
   added: (pred_1 obj_03 obj_02)
   goals met: 2 of 4
4. (op_1 obj_01 obj_12 obj_13 obj_11)
   deleted: (pred_4 obj_12 obj_13) (pred_2 obj_01 obj_11)
   added: (pred_3 obj_01 obj_12 obj_11)
   goals met: 2 of 4
5. (op_3 obj_03 obj_04 obj_02 obj_10)
   deleted: (pred_3 obj_03 obj_04 obj_10)
   added: (pred_4 obj_04 obj_02) (pred_2 obj_03 obj_10)
   goals met: 3 of 4
6. (op_2 obj_01 obj_13 obj_14)
   deleted: (pred_1 obj_01 obj_13)
   added: (pred_1 obj_01 obj_14)
   goals met: 3 of 4
7. (op_3 obj_01 obj_12 obj_14 obj_11)
   deleted: (pred_3 obj_01 obj_12 obj_11)
   added: (pred_4 obj_12 obj_14) (pred_2 obj_01 obj_11)
   goals met: 4 of 4
